# ModelGraphicsStyle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ModelGraphicsStyle Property
ParameterTypeId Class See Also
---
"Visual Style"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ModelGraphicsStyle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ModelGraphicsStyle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ModelGraphicsStyle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace